In [112]:
#把3個表格結合 json轉成dict 
cv_json =[]
cvs = ['cv','cv1','cv2']

for each in cvs:
    with open(f'./mod05/{each}.json' ,mode ='r' ,encoding = 'utf-8') as f:
        content=f.read()
        content=json.loads(content)
        cv_json.append(content)
cv_json

[{'name': 'Wes',
  'places_lived': ['United States', 'Spain', 'Germany'],
  'pet': None,
  'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
   {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]},
 {'name': 'Matt',
  'places_lived': ['Taiwan', 'Taipei'],
  'pet': 2,
  'siblings': [{'name': 'Alice', 'age': 30, 'pets': ['Apple']},
   {'name': 'Mary', 'age': 31, 'pets': ['A', 'B', 'C']}]},
 {'name': 'Crystal',
  'places_lived': ['Taiwan', 'Taichung'],
  'pet': None,
  'siblings': [{'name': 'Alex', 'age': 35, 'pets': ['Orange']},
   {'name': 'Ma', 'age': 50, 'pets': ['D', 'E']}]}]

In [113]:
#新增 id 也就index 
for i ,each in enumerate(cv_json):
    each['id']=i
cv_json

[{'name': 'Wes',
  'places_lived': ['United States', 'Spain', 'Germany'],
  'pet': None,
  'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
   {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}],
  'id': 0},
 {'name': 'Matt',
  'places_lived': ['Taiwan', 'Taipei'],
  'pet': 2,
  'siblings': [{'name': 'Alice', 'age': 30, 'pets': ['Apple']},
   {'name': 'Mary', 'age': 31, 'pets': ['A', 'B', 'C']}],
  'id': 1},
 {'name': 'Crystal',
  'places_lived': ['Taiwan', 'Taichung'],
  'pet': None,
  'siblings': [{'name': 'Alex', 'age': 35, 'pets': ['Orange']},
   {'name': 'Ma', 'age': 50, 'pets': ['D', 'E']}],
  'id': 2}]

In [126]:
#給info col名字 存在person表格中

info_col=['name','places_lived','pet','id']
person=pd.DataFrame(cv_json,columns=info_col)
person

      name                     places_lived  pet  id
0      Wes  [United States, Spain, Germany]  NaN   0
1     Matt                 [Taiwan, Taipei]  2.0   1
2  Crystal               [Taiwan, Taichung]  NaN   2

In [115]:
#表格中nan的值 的變成0
person.pet=person.pet.fillna(0)
person

      name                     places_lived  pet
0      Wes  [United States, Spain, Germany]  0.0
1     Matt                 [Taiwan, Taipei]  2.0
2  Crystal               [Taiwan, Taichung]  0.0

In [116]:
#再來處理 sibling,變成dataframe ,並放在pieces表格, 給id
pieces =[]
for each in cv_json:
    sib=pd.DataFrame(each['siblings'])
    sib['id']=each['id']
    pieces.append(sib)
pieces

[    name  age                    pets  id
 0  Scott   30            [Zeus, Zuko]   0
 1  Katie   38  [Sixes, Stache, Cisco]   0,
     name  age       pets  id
 0  Alice   30    [Apple]   1
 1   Mary   31  [A, B, C]   1,
    name  age      pets  id
 0  Alex   35  [Orange]   2
 1    Ma   50    [D, E]   2]

In [117]:
#結合sibling表格。並存在 sibling
siblings=pd.concat(pieces)
siblings

    name  age                    pets  id
0  Scott   30            [Zeus, Zuko]   0
1  Katie   38  [Sixes, Stache, Cisco]   0
0  Alice   30                 [Apple]   1
1   Mary   31               [A, B, C]   1
0   Alex   35                [Orange]   2
1     Ma   50                  [D, E]   2

In [123]:
#給sibling 欄位重新命名
siblings.columns=['sib_name','sib_age','sib_pets','id']
siblings

  sib_name  sib_age                sib_pets  id
0    Scott       30            [Zeus, Zuko]   0
1    Katie       38  [Sixes, Stache, Cisco]   0
0    Alice       30                 [Apple]   1
1     Mary       31               [A, B, C]   1
0     Alex       35                [Orange]   2
1       Ma       50                  [D, E]   2

In [127]:
#結合 person和sibling表格
pd.merge(person, siblings)

,name,places_lived,pet,id,sib_name,sib_age,sib_pets
0,Wes,"[United States, Spain, Germany]",NaN,0,Scott,30,"[Zeus, Zuko]"
1,Wes,"[United States, Spain, Germany]",NaN,0,Katie,38,"[Sixes, Stache, Cisco]"
2,Matt,"[Taiwan, Taipei]",2.0,1,Alice,30,[Apple]
3,Matt,"[Taiwan, Taipei]",2.0,1,Mary,31,"[A, B, C]"
4,Crystal,"[Taiwan, Taichung]",NaN,2,Alex,35,[Orange]
5,Crystal,"[Taiwan, Taichung]",NaN,2,Ma,50,"[D, E]"

#  <font color=red> Module_05_資料的載入與儲存</font>

## 處理CSV及文字、表格格式的資料

In [1]:
import pandas as pd
import numpy as np
import sys
import json 
import pickle
from datetime import datetime


msft = pd.read_csv('./mod05/msft.csv')
msft[:5]

        Date   Open   High    Low  Close   Volume
0  7/21/2014  83.46  83.53  81.81  81.93  2359300
1  7/18/2014  83.30  83.40  82.52  83.35  4020800
2  7/17/2014  84.35  84.63  83.33  83.63  1974000
3  7/16/2014  83.77  84.91  83.66  84.91  1755600
4  7/15/2014  84.30  84.38  83.20  83.58  1874700

In [ ]:
# 指定索引行是第幾行，從 0 開始算起
# 當然也可以讀進來後再用 .set_index() 方法
msft = pd.read_csv('./mod05/msft.csv', index_col = 0) 
msft[:5]

In [ ]:
df=pd.read_csv('./mod05/msft.csv',
           usecols =['Date','Low'],
           index_col= ['Date'])
df

In [ ]:
msft.dtypes

In [ ]:
# dtype 可能不是我們要的資料型態
msft.index

In [ ]:
# 可以利用 dtype 參數來決定每一欄的資料型態，寫成字典
# 字典的值通常寫 np.float64 或字串 'float' 都能過成功
msft = pd.read_csv('./mod05/msft.csv', dtype = {'Volume': np.float64}) 
msft.dtypes

In [ ]:
# 預設是 header = 'infer'
# 試試看改成 header = None，header = 0，header = 1 的差別   #header 標頭   #name 改標頭名字
df = pd.read_csv('./mod05/msft.csv', 
                 header = 0, 
                 names = ['date', 'open', 'high', 'low', 'close', 'volume']) 
df[:5]

In [ ]:
# 用 userclos 參數指定載入特定的行
# 這裡一定要載入 Date，因為我們要把他設定成索引標籤
df2 = pd.read_csv('./mod05/msft.csv', 
                    usecols = ['Date', 'Close'],
                    index_col = ['Date']) 
df2[:5]

In [ ]:
# 用 .to_csv() 方法把 dataFrame 存成 csv
# 如果索引標籤沒有名字，可以用參數 index_label 給索引標籤取名
df2.to_csv('./mod05/msft_modified.csv', index_label = 'Date')

---

In [ ]:
# 可以用參數 sep 來指定資料是用什麼符號來分隔欄位
# 也可以用 pd.read_table('./mod05/msft.csv', sep =',')，一模一樣的效果
df = pd.read_csv('./mod05/msft.csv', sep = ',') 
df

In [ ]:
# 用 .to_csv() 方法把 dataFrame 存成用 | 隔開的文字檔
# 用參數 index 來決定要不要存 index
df.to_csv('./mod05/msft.piped.txt', sep = '|', index = False)

In [ ]:
# 再讀回來
df = pd.read_csv('./mod05/msft.piped.txt', sep = '|')
df[:5]

---

In [ ]:
# 使用參數 skiprows 來排除額外的頁眉
df = pd.read_csv('./mod05/msft2.csv', skiprows = [0, 2, 3])   #skiprows 跳過 指定列
df

In [ ]:
# 用參數 skipfooter 來排除額外的檔尾，skipfooter = 2 表示最後兩列要被排除
# 因為pandas搜尋引擎是C 沒這功能，所以要加 engine = 'python'
df = pd.read_csv('./mod05/msft_with_footer.csv', 
                 skipfooter = 2,
                 engine = 'python')   
df

In [ ]:
# 有時檔案太大，只想讀前面幾列
# 用參數 nrows 來決定讀取前幾列  numberrows
pd.read_csv('./mod05/msft.csv', nrows = 3)

In [ ]:
pd.read_csv('./mod05/msft.csv', 
            skiprows = 2, 
            nrows = 3,
            header = 0,
            names = ['date', 'open', 'high', 'low', 'close', 'volume']) # 注意流程有沒有跟妳想的一樣

---

In [ ]:
df = pd.read_csv('./mod05/ex1.csv')
df

In [ ]:
# pd.read_table() 函式預設的 sep 是空格 
# 可以把 sep 拿掉看看差別 
df = pd.read_table('./mod05/ex1.csv', sep = ',') 
df

In [ ]:
df = pd.read_table('./mod05/ex1.csv') 
df

In [ ]:
df = pd.read_csv('./mod05/ex2.csv',header = None) # 說明檔案沒有標頭
df

In [ ]:
df = pd.read_csv('./mod05/ex2.csv', header = None, names = ['a', 'b', 'c', 'd', 'message'])    
df

In [ ]:
df =pd.read_csv('./mod05/csv_mindex.csv', index_col = ['key1', 'key2']) # 階層式索引
df

In [ ]:
# 使用正規表達式   \s : 包含全部空白
# 試試看 sep = ' ' 會如何
# 因為第 0 欄沒名字被當成索引
df = pd.read_table('./mod05/ex3.txt', sep = '\s+')   
df

--------------------------------------------------------
df=pd.read_csv('./mod05/ex3.txt',sep='\s+')
df

In [ ]:
df = pd.read_table('./mod05/ex3.txt', sep = ' ')     
df

---

In [ ]:
# pandas 對遺失值的標記
# 如果是 NA 或是都沒輸入會顯示 NaN
# 注意空格會被認為是空格字串，而不是遺失值
df = pd.read_csv('./mod05/ex5.csv') 
df

In [ ]:
df.isnull()

In [ ]:
# 可以用 na_values 參數來自定義那些值也是遺失值
df = pd.read_csv('./mod05/ex5.csv', na_values = ['NULL', 'foo']) # NULL 和 foo 也要當遺失值
df

In [ ]:
 # 對每個欄指定不同的 NA 標記值
df = pd.read_csv('./mod05/ex5.csv', na_values = {'message': ['foo', 'NA'], 'something': ['two']})
df

---

In [ ]:
# 如果數據超大，可用 chunksize 分段讀取
chunker = pd.read_csv('./mod05/ex6.csv', chunksize = 1000) # 分段讀取檔案
chunker

In [ ]:
tot = pd.Series([], dtype = 'float64')
tot

In [ ]:
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value = 0)
    
tot = tot.sort_values(ascending = False) 
tot

---

In [ ]:
data = pd.read_csv('./mod05/ex5.csv')
data

In [ ]:
data.to_csv(sys.stdout, sep = '|') # 寫到 sys.stdout，這樣會把文字改為顯示在終端機上

In [ ]:
# 把遺失值用 'Null' 輸出
# na_rep 就是 A string representation of a missing value 
data.to_csv(sys.stdout, sep = '|', na_rep = 'Null')

In [ ]:
data.to_csv(sys.stdout, index = False, header = False)

In [ ]:
data.to_csv(sys.stdout, index = False, columns = ['a','b','c']) # 只寫出部分的欄位

---

In [ ]:
dates = pd.date_range('2000/1/1', periods = 7)
ts = pd.Series(np.arange(7), index = dates)
ts

In [ ]:
ts.to_csv('./mod05/tseries.csv') # 序列一樣有 .to_csv() 方法可用

## 讀寫 Excel 格式資料

In [3]:
# 需要安裝 xlrd、openpyxl 套件來讀 XLS 及 XLSX 檔案 
# XLSX 檔案是比較新的格式，通常都會把 Excel 存成 .xlsx 檔
df = pd.read_excel('./mod05/stocks.xlsx') 
df

           Date   Open   High    Low  Close   Volume
0    2014-07-21  83.46  83.53  81.81  81.93  2359300
1    2014-07-18  83.30  83.40  82.52  83.35  4020800
2    2014-07-17  84.35  84.63  83.33  83.63  1974000
3    2014-07-16  83.77  84.91  83.66  84.91  1755600
4    2014-07-15  84.30  84.38  83.20  83.58  1874700
...         ...    ...    ...    ...    ...      ...
3762 2000-01-07  48.55  50.35  47.80  50.00  4621200
3763 2000-01-06  46.78  48.35  46.28  48.03  3306100
3764 2000-01-05  46.94  47.50  45.92  46.75  4809900
3765 2000-01-04  49.80  49.80  47.72  47.85  4489500
3766 2000-01-03  52.70  53.20  49.60  49.75  3137300

[3767 rows x 6 columns]

In [4]:
# 很多參數跟 pd.read_csv() 一樣，就不重複
aapl = pd.read_excel('./mod05/stocks.xlsx', sheet_name = 'aapl') # 讀取其他頁面 
aapl[:5]

        Date   Open   High    Low  Close    Volume
0 2014-07-21  94.99  95.00  93.72  93.94  38887700
1 2014-07-18  93.62  94.74  93.02  94.43  49898600
2 2014-07-17  95.03  95.28  92.57  93.09  57152000
3 2014-07-16  96.97  97.10  94.74  94.78  53396300
4 2014-07-15  96.80  96.85  95.03  95.32  45477900

---

In [6]:
# 寫出需要 pip install XLWT
# 盡量不要存成 xls
# 存成 .xlsx 檔用 notepad++ 打開會亂碼
df.to_excel('./mod05/stock2.xlsx')

In [7]:
df.to_excel('./mod05/stock_msft.xlsx', sheet_name = 'MSFT', index = False)

In [8]:
# 寫入多頁面
with pd.ExcelWriter('./mod05/all_stocks.xlsx') as writer:
    aapl.to_excel(writer, sheet_name = 'AAPL')
    df.to_excel(writer, sheet_name = 'MSFT')

## 讀寫 JSON 檔案

In [9]:
df = pd.read_excel('./mod05/stocks.xlsx')
df[:5]

        Date   Open   High    Low  Close   Volume
0 2014-07-21  83.46  83.53  81.81  81.93  2359300
1 2014-07-18  83.30  83.40  82.52  83.35  4020800
2 2014-07-17  84.35  84.63  83.33  83.63  1974000
3 2014-07-16  83.77  84.91  83.66  84.91  1755600
4 2014-07-15  84.30  84.38  83.20  83.58  1874700

In [34]:
# 注意存成 json 檔後的長相
df.to_json('./mod05/stocks.json')

In [ ]:
df_from_json = pd.read_json('./mod05/stocks.json') # json 具有跨平台與程式語言的可攜性
df_from_json[:5]

---

In [10]:
# 注意讀出來資料框的長相
data = pd.read_json('./mod05/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [36]:
data.to_json('./mod05/data.json')

In [37]:
# 設定 orient = 'records'，會輸出另一種 json 格式
data.to_json('./mod05/data1.json', orient = 'records')

---

In [7]:
df = pd.DataFrame(np.array([[1, 2], [3, 4]]), 
                  index = ['a', 'b'],
                  columns = ['col1', 'col2'])
df

   col1  col2
a     1     2
b     3     4

In [10]:
df.to_json('./mod05/test.json')

In [40]:
# orient = 'records' 不會存入索引標籤
df.to_json('./mod05/test1.json', orient = 'records')

 ----------------

In [2]:
# All arrays must be of the same length
# 不是 json 檔就一定可以讀成 Dataframe
pd.read_json('./mod05/cv.json')

ValueError: arrays must all be same length

# json.dumps() 把pyrhon 編碼成 json字串 
# json.loads() 把json  編碼成 python

In [12]:
# 利用 json 套件來處理
with open('./mod05/cv.json', mode = 'r', encoding = 'utf-8') as f:
    content = f.read()
    
my_dict = json.loads(content)
my_dict

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [13]:
type(my_dict)

dict

In [14]:
# 每個欄位不一樣長的話沒辦法一次讀取成 dataframe
# 要分開讀成 dataFrame，再用 pd.concat() 或 pd.merge() 函式等等來合併
siblings = pd.DataFrame(my_dict['siblings']) 
siblings

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

--------------------

### 以下寫法熟記

In [101]:
# 常見的應用，把個人檔案建成資料框
cv_json = []
cvs = ['cv', 'cv1', 'cv2']
for each in cvs:
    with open(f'./mod05/{each}.json', mode = 'r', encoding='utf-8') as f:
        content = f.read()
        content = json.loads(content)
        cv_json.append(content)

In [102]:
cv_json

[{'name': 'Wes',
  'places_lived': ['United States', 'Spain', 'Germany'],
  'pet': None,
  'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
   {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]},
 {'name': 'Matt',
  'places_lived': ['Taiwan', 'Taipei'],
  'pet': 2,
  'siblings': [{'name': 'Alice', 'age': 30, 'pets': ['Apple']},
   {'name': 'Mary', 'age': 31, 'pets': ['A', 'B', 'C']}]},
 {'name': 'Crystal',
  'places_lived': ['Taiwan', 'Taichung'],
  'pet': None,
  'siblings': [{'name': 'Alex', 'age': 35, 'pets': ['Orange']},
   {'name': 'Ma', 'age': 50, 'pets': ['D', 'E']}]}]

In [103]:
for i, each in enumerate(cv_json):
    each['id'] = i   #新增key的方式

In [104]:
cv_json

[{'name': 'Wes',
  'places_lived': ['United States', 'Spain', 'Germany'],
  'pet': None,
  'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
   {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}],
  'id': 0},
 {'name': 'Matt',
  'places_lived': ['Taiwan', 'Taipei'],
  'pet': 2,
  'siblings': [{'name': 'Alice', 'age': 30, 'pets': ['Apple']},
   {'name': 'Mary', 'age': 31, 'pets': ['A', 'B', 'C']}],
  'id': 1},
 {'name': 'Crystal',
  'places_lived': ['Taiwan', 'Taichung'],
  'pet': None,
  'siblings': [{'name': 'Alex', 'age': 35, 'pets': ['Orange']},
   {'name': 'Ma', 'age': 50, 'pets': ['D', 'E']}],
  'id': 2}]

In [105]:
info_col = ['id', 'name', 'places_lived', 'pet']
person = pd.DataFrame(cv_json, columns = info_col)
person

   id     name                     places_lived  pet
0   0      Wes  [United States, Spain, Germany]  NaN
1   1     Matt                 [Taiwan, Taipei]  2.0
2   2  Crystal               [Taiwan, Taichung]  NaN

In [106]:
person.pet = person.pet.fillna(0)
person

   id     name                     places_lived  pet
0   0      Wes  [United States, Spain, Germany]  0.0
1   1     Matt                 [Taiwan, Taipei]  2.0
2   2  Crystal               [Taiwan, Taichung]  0.0

In [107]:
pieces = []
for each in cv_json:
    sib = pd.DataFrame(each['siblings'])
    sib['id'] = each['id']
    pieces.append(sib)

In [108]:
pieces

[    name  age                    pets  id
 0  Scott   30            [Zeus, Zuko]   0
 1  Katie   38  [Sixes, Stache, Cisco]   0,
     name  age       pets  id
 0  Alice   30    [Apple]   1
 1   Mary   31  [A, B, C]   1,
    name  age      pets  id
 0  Alex   35  [Orange]   2
 1    Ma   50    [D, E]   2]

In [109]:
siblings = pd.concat(pieces)
siblings

    name  age                    pets  id
0  Scott   30            [Zeus, Zuko]   0
1  Katie   38  [Sixes, Stache, Cisco]   0
0  Alice   30                 [Apple]   1
1   Mary   31               [A, B, C]   1
0   Alex   35                [Orange]   2
1     Ma   50                  [D, E]   2

In [110]:
siblings.columns = ['sib_name', 'sib_age', 'sib_pet', 'id']
siblings

  sib_name  sib_age                 sib_pet  id
0    Scott       30            [Zeus, Zuko]   0
1    Katie       38  [Sixes, Stache, Cisco]   0
0    Alice       30                 [Apple]   1
1     Mary       31               [A, B, C]   1
0     Alex       35                [Orange]   2
1       Ma       50                  [D, E]   2

In [111]:
# 就類似資料庫的 MySQL
pd.merge(person, siblings)

,id,name,places_lived,pet,sib_name,sib_age,sib_pet
0,0,Wes,"[United States, Spain, Germany]",0.0,Scott,30,"[Zeus, Zuko]"
1,0,Wes,"[United States, Spain, Germany]",0.0,Katie,38,"[Sixes, Stache, Cisco]"
2,1,Matt,"[Taiwan, Taipei]",2.0,Alice,30,[Apple]
3,1,Matt,"[Taiwan, Taipei]",2.0,Mary,31,"[A, B, C]"
4,2,Crystal,"[Taiwan, Taichung]",0.0,Alex,35,[Orange]
5,2,Crystal,"[Taiwan, Taichung]",0.0,Ma,50,"[D, E]"

## 從網站讀取 HTML 資料

In [40]:
# 需要 lxml、html5lib、BeautifulSoup4 套件
# 可以抓取 url 上的列表，但不是每個網站都能成功
# 不行只能爬蟲
url = "https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/"
banks = pd.read_html(url)

In [41]:
len(banks) # 回傳一至多個 Dataframe 物件，傳回 Dataframe 的列表 (依照 Html 裡面有多少表格而定)

1

In [42]:
banks

[                         Bank NameBank           CityCity StateSt  CertCert  \
 0                    Almena State Bank             Almena      KS     15426
 1           First City Bank of Florida  Fort Walton Beach      FL     16748
 2                 The First State Bank      Barboursville      WV     14361
 3                   Ericson State Bank            Ericson      NE     18265
 4     City National Bank of New Jersey             Newark      NJ     21111
 ..                                 ...                ...     ...       ...
 558                 Superior Bank, FSB           Hinsdale      IL     32646
 559                Malta National Bank              Malta      OH      6629
 560    First Alliance Bank & Trust Co.         Manchester      NH     34264
 561  National State Bank of Metropolis         Metropolis      IL      3815
 562                   Bank of Honolulu           Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0                            Equity Bank    October 23, 2020     10538
 1              United Fidelity Bank, fsb    October 16, 2020     10537
 2                         MVB Bank, Inc.       April 3, 2020     10536
 3             Farmers and Merchants Bank   February 14, 2020     10535
 4                        Industrial Bank    November 1, 2019     10534
 ..                                   ...                 ...       ...
 558                Superior Federal, FSB       July 27, 2001      6004
 559                    North Valley Bank         May 3, 2001      4648
 560  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 561              Banterra Bank of Marion   December 14, 2000      4646
 562                   Bank of the Orient    October 13, 2000      4645

 [563 rows x 7 columns]]

In [43]:
failures = banks[0]
failures

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [44]:
failures.dtypes

Bank NameBank              object
CityCity                   object
StateSt                    object
CertCert                    int64
Acquiring InstitutionAI    object
Closing DateClosing        object
FundFund                    int64
dtype: object

In [45]:
 # 也可以用 pd.to_datetime() 函式，後面會教到
close_timestamps = failures['Closing DateClosing'].astype('datetime64[ns]') # 也可以用 pd.to_datetime() 函式
close_timestamps

0     2020-10-23
1     2020-10-16
2     2020-04-03
3     2020-02-14
4     2019-11-01
         ...
558   2001-07-27
559   2001-05-03
560   2001-02-02
561   2000-12-14
562   2000-10-13
Name: Closing DateClosing, Length: 563, dtype: datetime64[ns]

In [46]:
close_timestamps.dt.year

0      2020
1      2020
2      2020
3      2020
4      2019
       ...
558    2001
559    2001
560    2001
561    2000
562    2000
Name: Closing DateClosing, Length: 563, dtype: int64

In [47]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2017      8
2015      8
2016      5
2019      4
2020      4
2001      4
2004      4
2007      3
2003      3
2000      2
Name: Closing DateClosing, dtype: int64

---

In [63]:
df = pd.read_excel('./mod05/stocks.xlsx')
df[:5]

        Date   Open   High    Low  Close   Volume
0 2014-07-21  83.46  83.53  81.81  81.93  2359300
1 2014-07-18  83.30  83.40  82.52  83.35  4020800
2 2014-07-17  84.35  84.63  83.33  83.63  1974000
3 2014-07-16  83.77  84.91  83.66  84.91  1755600
4 2014-07-15  84.30  84.38  83.20  83.58  1874700

In [64]:
df[:5].to_html('./mod05/stocks.html') # 會為資料產生只擁有 <table> 標籤的檔案

## 讀寫 Pickle 格式檔案

In [65]:
# 是一種儲存二進位格式資料 (也稱為序列化 serialization)

import pandas as pd

frame = pd.read_csv('./mod05/ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [66]:
frame.to_pickle('./mod05/frame_pickle')

In [67]:
pd.read_pickle('./mod05/frame_pickle') # 也可以用之前學過的方式，用內建的 pickle 讀取檔案中任何被 pickle 的物件

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

---

## 讀寫 HDF5 格式檔案

In [73]:
# HDF5 也是常見的一種二進位檔案格式，另一個是 MessagePack

import pandas as pd 
import numpy as np

np.random.seed(123456)
df= pd.DataFrame(np.random.randn(8, 3), 
                 index = pd.date_range('1/1/2020', periods = 8),
                 columns = ['A', 'B', 'C'])
df

                   A         B         C
2020-01-01  0.469112 -0.282863 -1.509059
2020-01-02 -1.135632  1.212112 -0.173215
2020-01-03  0.119209 -1.044236 -0.861849
2020-01-04 -2.104569 -0.494929  1.071804
2020-01-05  0.721555 -0.706771 -1.039575
2020-01-06  0.271860 -0.424972  0.567020
2020-01-07  0.276232 -1.087401 -0.673690
2020-01-08  0.113648 -1.478427  0.524988

In [74]:
# 需要用管理者開啟 CMD 安裝 tables 套件
# 把右邊的資料框 df 存進 store 裡，key 為 df 

store = pd.HDFStore('./mod05/store.h5') 
store['df'] = df

In [75]:
store.keys()

['/df']

--------------

In [ ]:
store = pd.HDFStore('./mod05/store.h5')
store.keys()

In [ ]:
frame = store['df']
frame[:5]

In [ ]:
# 把 frame 做點修改再存進去 store
frame.iloc[0].A = 1
frame

In [ ]:
store['df'] = frame

----------------

In [ ]:
# 再從 store 取出看有沒有更新
# 快速的寫法

pd.HDFStore('./mod05/store.h5')['df'][:5]

In [ ]:
# 最後要把 store 關閉
store.close()

---

In [ ]:
frame = pd.DataFrame({'a': np.random.randn(100)})
frame[:5]

In [ ]:
store = pd.HDFStore('./mod05/mydata.h5')

In [ ]:
store

In [ ]:
# 小心本來有檔案在裡面，是有可能重複存的
store.keys()

In [ ]:
# 這是資料框
store['obj1'] = frame

In [ ]:
# 這是序列
store['obj1_col'] = frame['a']

In [ ]:
store.keys()

In [ ]:
store['obj1']

In [ ]:
del store['obj1']

In [ ]:
store.keys()

In [ ]:
# 是 store['obj1'] = frame 的顯式寫法，可以讓我們指定像是儲存格式等參數
# HDFStore 支援 'fixed' 與 'table' 兩種儲存方式，後者慢一點，但它支援特殊的查詢語法
# 把之前的資料框存進 store，key 為 obj1
store.put('obj1', frame, format = 'table')

In [ ]:
store.keys()

In [ ]:
store.select('obj1', where = ['index >= 10 and index <= 15'])

In [ ]:
store.close()

---

In [ ]:
# 上面的更精簡寫法

frame.to_hdf('./mod05/mydata.h5', 'obj2', format = 'table')

In [ ]:
pd.read_hdf('./mod05/mydata.h5', 'obj2', where = ['index < 5'] )

## 存取網站上的 CSV 資料

In [ ]:
# 用 Python 來抓取政府公開資料(CSV)
# 不是一定會成功
frame = pd.read_csv("https://data.nhi.gov.tw/Datasets/Download.ashx?rid=A21030000I-D50001-001&l=https://data.nhi.gov.tw/resource/mask/maskdata.csv")
frame[:5]

## 存取 MySQL 資料庫

In [ ]:
#同步學習python mod23

# 利用 sqlalchemy 套件，從 MySQL 資料庫讀出資料寫成資料框

In [3]:
from sqlalchemy import create_engine

# 先安裝套件 sqlalchemy
# 連接資訊務必要打對!
# 'mysql+module://username:password@ip:port/dbname?charset=utf8mb4'
connect_info = 'mysql+pymysql://root:自己的密碼@localhost:3306/testdb?charset=utf8mb4'

# 使用 sqlalchemy 去建立連接引擎 (link-engine)
engine = create_engine(connect_info) 


sql = "SELECT * FROM staff" # SQL 語法
df = pd.read_sql(sql = sql, 
                 con = engine, 
                 parse_dates = 'recordDt')

In [4]:
df

Empty DataFrame
Columns: [ID, Name, DeptId, Age, Gender, Salary, recordDt]
Index: []

In [5]:
# 讀進資料框的每欄位的資料型態是 pandas 觀察出的，不一定是你要的資料型態
df.dtypes

ID                  object
Name                object
DeptId              object
Age                 object
Gender              object
Salary              object
recordDt    datetime64[ns]
dtype: object

In [6]:
df['ID'] = df['ID'].astype('int')
df['Name'] = df['Name'].astype('S10')
df['DeptId'] = df['DeptId'].astype('int')

In [7]:
df.dtypes

ID                   int64
Name                  |S10
DeptId               int64
Age                 object
Gender              object
Salary              object
recordDt    datetime64[ns]
dtype: object

---

In [1]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /opt/anaconda3/lib/python3.8/site-packages (1.4.7)
Requirement already satisfied: greenlet!=0.4.17 in /opt/anaconda3/lib/python3.8/site-packages (from sqlalchemy) (1.0.0)

# 利用 sqlalchemy 套件，把資料框寫進 MySQL 資料庫

In [5]:
import pandas as pd
from datetime import datetime
from sqlalchemy import create_engine
from sqlalchemy.types import NVARCHAR, Float, Integer

# 'mysql+module://username:password@ip:port/dbname?charset=utf8mb4'
connect_info = 'mysql+pymysql://root:Billy1102@localhost:3306/testdb?charset=utf8mb4'
engine = create_engine(connect_info) # 使用 sqlalchemy 去建立連接引擎 (link-engine)

In [6]:
# 隨便建一個資料框，準備存入 MySQL
df = pd.DataFrame([['a', 1, 2.0, datetime.now(), True]], 
                   columns = ['str', 'int', 'float', 'datetime', 'boolean'])
df

  str  int  float                   datetime  boolean
0   a    1    2.0 2021-08-28 23:04:32.986864     True

In [ ]:
print(df.dtypes)

In [ ]:
# 把資料框寫入 MySQL 
# name 是表格名
# 不管寫出寫入都要注意每個欄位資料型態的改變
# 指定欄位的資料型態

df.to_sql(name = 'data_from_df',  
           con = engine,
           if_exists = 'append',
           index = False,
           dtype= {'str': NVARCHAR(length=255),
                   'int': Integer(),
                   'float':Float()
                    })